Ext.define('EC.Main.view.ForCustomers', {

    extend: 'Ext.panel.Panel',

    autoScroll: true,
    
    layout: 'fit',
    
    html: '<div style="text-align: justify; padding: 10px;">' +
        '<p style="text-indent: 2em;">' +
        'Для заказчиков проектов Корпоративный портал планирования и реализации ' +
        'инженерных проектов ОАО «Евразклимат» служит высокотехнологичной ' +
        'комфортной рабочей площадкой полного цикла, обладающей максимально ' +
        'широким набором информационных и методологических возможностей ' +
        'для осуществления подготовки, рабочего планирования, исполнения, ' +
        'контроля и сдачи работ проектов.</p>' +
        
        '<p style="text-indent: 2em;">' +
        'Пользователи-заказчики могут осуществлять на Портале первичный анализ ' +
        'своих проектов силами высококлассных специалистов инженерного профиля, ' +
        'также являющихся пользователями Портала; из числа данных специалистов, ' +
        'которые получают на Портале соответствующие статусы - с учетом ' +
        'сертификаций и рейтингов, заказчики могут набирать необходимые им ' +
        'профессиональные исполнительские коллективы.</p>' +
        
        '<p style="text-indent: 2em;">' +
        'Пользуясь мощной, постоянно обновляемой информационной базой Портала, ' +
        'включающей актуальные каталоги инженерного оборудования всех типов - ' +
        'с ценами, условиями поставки, подробными описаниями и складскими ' +
        'справками, заказчики легко могут спланировать бюджет закупок. ' +
        'Также заказчики могут использовать информацию каталогов, касающуюся цены, ' +
        'стоимости и условий оказания инженерных услуг, и выбрать необходимых ' +
        'для проекта поставщиков услуг.</p>' +
        
        '<p style="text-indent: 2em;">' +
        'К услугам заказчиков обширная методологическая и техническая база Портала, ' +
        'включающая все необходимые для реализации инженерных проектов методики, ' +
        'сервисы, шаблоны, алгоритмы, формы документов, средства расчетов, ' +
        'финансового планирования и контроля.</p>' +
        
        '<p style="text-indent: 2em;">' +
        'Вся деятельность заказчиков на Портале осуществляется в максимально ' +
        'комфортных условиях, создаваемых как оптимальной эргономикой навигации ' +
        'и каждого из разделов Портала, так и большим набором сервисов отдыха, ' +
        'в том числе сервисов телевидения, игр, музыки и др.</p>'
        
        + '</div>'
});