Ext.define('EC.Main.view.ForCustomers', {

    extend: 'Ext.panel.Panel',

    autoScroll: true,
    
    layout: 'fit',
    
    html: '<div style="text-align: justify; padding: 10px;">' +
        '<h5 style="text-align: center;">Партнерские взаимоотношения ' +
        'ОАО «ЕВРАЗКЛИМАТ» с заказчиками</h5>' +
        
        '<p style="text-indent: 2em;">' +
        'Организация работы ОАО «Евразклимат» с заказчиками исходит из необходимости ' +
        'обеспечения высокотехнологичной, эффективной реализации их проектов, ' +
        'с использованием всех современных информационных и методологических ' +
        'возможностей для подготовки, рабочего планирования, исполнения, контроля ' +
        'и сдачи работ проектов.</p>' +
        
        '<p style="text-indent: 2em;">' +
        'По желанию заказчиков ОАО «Евразклимат» осуществляет для них как ' +
        'отдельные работы, так и полный комплекс необходимых им услуг, включающий:</p>' +
        
        '<ul>' +
        '<li>Первичный анализ проектов</li>' +
        '<li>Разработка, утверждение и контроль исполнения графиков производства работ</li>' +
        '<li>Проектирование</li>' +
        '<li>Комплектацию объектов инженерной продукцией и/или материалами</li>' +
        '<li>Осуществление логистических работ</li>' +
        '<li>Производство строительно-монтажных работ</li>' +
        '<li>Организация выполнения шеф-монтажных и пуско-наладочных работ</li>' +
        '<li>Обеспечение функций технического надзора</li>' +
        '<li>Производство нестандартного оборудования и изделий</li>' +
        '<li>Разработку и производство электро-щитового оборудования</li>' +
        '<li>Осуществление гарантийного и постгарантийного (сервисного) обслуживания</li>' +
        '</ul>' +
        
        '<p style="text-indent: 2em;">' +
        'Для исполнения каждого проекта к услугам заказчиков высококвалифицированные ' +
        'инженерные специалисты ОАО «Евразклимат», обладающие всеми необходимыми ' +
        'сертификатами и лицензиями.</p>' +
        
        '<p style="text-indent: 2em;">' +
        'Благодаря наличию у ОАО «Евразклимат» постоянно обновляемой информационной ' +
        'базы, включающей актуальные каталоги, формируемые только по согласованию ' +
        'с производителями соответствующего инженерного оборудования и услуг, ' +
        'компания, если это необходимо заказчикам, помогает им спланировать ' +
        'бюджеты проектов, формировать спецификации и рабочие документы проекта.</p>' +
        
        '<p style="text-indent: 2em;">' +
        'В интересах заказчиков ОАО «Евразклимат» на базе своего сайта создает ' +
        'специальный интернет-ресурс, предназначенный в том числе для планирования, ' +
        'формирования и контроля реализации любых инженерных проектов. ' +
        'К услугам заказчиков, которым на сайте будут предоставляться ' +
        '«личные кабинеты», формируется обширная методологическая и техническая база, ' +
        'включающая все необходимые для реализации инженерных проектов каталоги, ' +
        'методики, сервисы, шаблоны, алгоритмы, формы документов, средства расчетов, ' +
        'финансового планирования и контроля.</p>' +
        
        '<p style="text-indent: 2em;">' +
        'Создаваемый информационный ресурс ОАО «Евразклимат» будет обеспечивать ' +
        'работу и взаимодействие заказчиков по планированию и исполнению проектов ' +
        'в максимально комфортных условиях, благодаря оптимальной эргономике ' +
        'и навигации информационный ресурса, а также благодаря разнообразным ' +
        'сервисам отдыха, таким как сервисы ТВ, игры, музыки и др.</p>'
        
        + '</div>'
});