Ext.define('EC.Main.view.ForManufacturers', {

    extend: 'Ext.panel.Panel',

    autoScroll: true,
    
    layout: 'fit',
    
    html: '<div style="text-align: justify; padding: 10px;">' +
        '<h5 style="text-align: center;">Партнерские взаимоотношения ' +
        'ОАО «ЕВРАЗКЛИМАТ» с производителями оборудования</h5>' +
        
        '<p style="text-indent: 2em;">' +
        'Непременным условием эффективной работы компании является укрепление ' +
        'партнерских отношений с производителями современного инженерного оборудования, ' +
        'выстраивание системы своей работы, с учётом интересов производителей.</p>' +
        
        '<p style="text-indent: 2em;">' +
        'Вся работа ОАО «Евразклимат» с заказчиками и специалистами базируется ' +
        'на постоянно обновляемой актуальной информации об оборудовании, ' +
        'поступающей от производителей или от их официальных представителей. ' +
        'Наделенные необходимой квалификацией сотрудники компании контролируют ' +
        'правильность и актуальность информации об оборудовании, размещенной ' +
        'в каталогах ОАО «Евразклимат». Находясь в постоянном контакте ' +
        'с представителями производителей, они оперативно вносят в каталоги ' +
        'компании необходимые изменения.</p>' +
        
        '<p style="text-indent: 2em;">' +
        'Организованная компанией система контроля качества поставляемого заказчикам ' +
        'оборудования исключает реализацию контрафактного или вышедшего из строя ' +
        'инженерного оборудования. Наличие необходимых сертификатов оборудования ' +
        'является непременным условием реализации проектов ОАО «Евразклимат».</p>' +
        
        '<p style="text-indent: 2em;">' +
        'По запросу заказчиков, консультации по работе с оборудованием производят ' +
        'имеющие соответствующие сертификаты специалисты ОАО «Евразклимат», или, ' +
        'по согласованию с компанией, сами уполномоченные сотрудники производителей.</p>' +
        
        '<p style="text-indent: 2em;">' +
        'С целью совершенствования взаимодействия ОАО «Евразклимат» с производителями, ' +
        'компания в рамках своего сайта разрабатывает специальный интернет-ресурс, ' +
        'где представителям производителей будут предоставлены необходимые ' +
        'информационные и операционные возможности в рамках эргономичных ' +
        '«личных кабинетов». Функционал «личных кабинетов» представителей ' +
        'производителей будет организован в соответствии с задачами данного ' +
        'взаимодействия, их «кабинеты» будут обладать всеми возможностями для ' +
        'оперативной навигации по сайту, для выбора и правок нужной информации ' +
        'в каталогах, для использования разнообразных методик, шаблонов и алгоритмов, ' +
        'которые будут размещены на сайте ОАО «Евразклимат». «Кабинеты» представителей ' +
        'производителей будут обладать всеми необходимыми коммуникативными ' +
        'возможностями для проведения согласований или консультаций с компанией.</p>' +
        
        '<p style="text-indent: 2em;">' +
        'Также комфортность работы на ОАО «Евразклимат» представителей ' +
        'производителей будет обеспечиваться большим набором сервисов отдыха, ' +
        'в том числе сервисов ТВ, игр, музыки и др.</p>'
        
        + '</div>'
});