Ext.define('EC.Main.view.ForManufacturers', {

    extend: 'Ext.panel.Panel',

    autoScroll: true,
    
    layout: 'fit',
    
    html: '<div style="text-align: justify; padding: 10px;">' +
        '<p style="text-indent: 2em;">' +
        'Непременным условием эффективной работы Портала является укрепление ' +
        'партнерских отношений с производителями современного инженерного оборудования, ' +
        'выстраивание системы работы на Портале, исходя из их интересов.</p>' +
        
        '<p style="text-indent: 2em;">' +
        'Вся размещаемая на Портале информация об оборудовании обновляется только ' +
        'на основе актуальных сведений, поступающих от соответствующих производителей ' +
        'или их официальных представителей. Наделенные необходимыми полномочиями ' +
        'сотрудники производителей контролируют правильность информации ' +
        'об оборудовании их компаний, размещенной в каталогах Портала, и имеют ' +
        'право изменять и дополнять данные сведения.</p>' +
        
        '<p style="text-indent: 2em;">' +
        'На Портале исключена реализация контрафактного или вышедшего из строя ' +
        'инженерного оборудования. Наличие необходимых сертификатов оборудования ' +
        'является непременным условием реализации проектов на Портале.</p>' +
        
        '<p style="text-indent: 2em;">' +
        'По запросу пользователей Портала консультации по работе с оборудованием ' +
        'производят имеющие соответствующие сертификаты специалисты, также являющиеся ' +
        'пользователями Портала, или уполномоченные сотрудники производителей.</p>' +
        
        '<p style="text-indent: 2em;">' +
        'Каждому представителю производителя обеспечиваются максимально комфортные ' +
        'условия для работы на Портале - им предоставляются эргономичные Личные кабинеты, ' +
        'функционал которых организован оптимально, в соответствии с задачами ' +
        'конкретного сотрудника. Личные кабинеты представителей производителей ' +
        'обладают всеми возможностями для оперативной навигации по Порталу, ' +
        'выбора и правок нужной информации в каталогах, использования имеющихся ' +
        'на Портале разнообразных методик, шаблонов и алгоритмов. ' +
        'Кабинеты обладают необходимыми коммуникативными возможностями для ' +
        'проведения согласований или консультаций.</p>' +
        
        '<p style="text-indent: 2em;">' +
        'Также комфортность работы на Портале представителей производителя обеспечивается ' +
        'большим набором сервисов отдыха, в том числе телевещания, игр, музыки и др.</p>'
        
        + '</div>'
});