Ext.define('EC.Main.view.ForSpecialists', {

    extend: 'Ext.panel.Panel',

    autoScroll: true,
    
    layout: 'fit',
    
    html: '<div style="text-align: justify; padding: 10px;">' +
        '<h5 style="text-align: center;">Развитие партнерских взаимоотношений ' +
        'ОАО «ЕВРАЗКЛИМАТ» с контрагентами – участниками проектов</h5>' +
        
        '<p style="text-indent: 2em;">' +
        'Компания ОАО «Евразклимат», ежегодно реализующая большое количество ' +
        'сложных инженерных проектов, обладающая прекрасно выстроенной системой ' +
        'планирования и исполнения проектов, ведет непрерывную работу ' +
        'по оптимизации и интенсификации рабочих взаимоотношений с контрагентами.</p>' +
        
        '<p style="text-indent: 2em;">' +
        'Вся цепочка единого цикла планирования и исполнения проектов реализуется ' +
        'компанией с учетом необходимости постоянного обмена информацией ' +
        'с контрагентами о каждом этапе и задаче исполняемых и новых проектов.</p>' +
        
        '<p style="text-indent: 2em;">' +
        'Компания заинтересована в постоянном совершенствовании информационного ' +
        'обмена и порядка согласования с контрагентами - участниками проектов, ' +
        'в том числе по вопросам цен, системы логистики, ' +
        'по условиям оказания проектных услуг.</p>' +
        
        '<p style="text-indent: 2em;">' +
        'ОАО «Евразклимат» оказывает партнерам, участвующим в исполнении проектов, ' +
        'любую необходимую им для этого помощь. В случае если это необходимо партнерам, ' +
        'наши специалисты оказывают им консультации по всем вопросам, связанным ' +
        'с организацией исполнения проектов.</p>' +
        
        '<p style="text-indent: 2em;">' +
        'В интересах совершенствования взаимодействия, в том числе с контрагентами, ' +
        'компания ОАО «Евразклимат» на своем сайте создает интернет-ресурс ' +
        'с «личными кабинетами», что значительно упростит и интенсифицирует ' +
        'согласования и методологический обмен в рамках проектов, позволив ' +
        'контрагентам еще более оперативно решать свои задачи в рамках проектов. ' +
        'Для эффективной организации проектной работы, на интернет-ресурсе будут ' +
        'собраны многочисленные современные методики планирования и расчетов, ' +
        'шаблоны всех видов проектных документов, алгоритмы осуществления операций ' +
        'в рамках инженерных проектов. </p>' +
        
        '<p style="text-indent: 2em;">' +
        'Кроме прекрасно организованной производственной и информационной среды, ' +
        'на интернет-ресурсе будут созданы условия для по-настоящему комфортной ' +
        'работы представителей контрагентов, которым кроме эргономичных ' +
        'адаптированных в соответствии с их пожеланиями «кабинетов» ' +
        'предлагается также большой набор сервисов отдыха, ' +
        'в том числе сервисы ТВ, игры, музыки и др.</p>'
        
        + '</div>'
});