Ext.define('EC.Main.view.ForSpecialists', {

    extend: 'Ext.panel.Panel',

    autoScroll: true,
    
    layout: 'fit',
    
    html: '<div style="text-align: justify; padding: 10px;">' +
        '<p style="text-indent: 2em;">' +
        'Самые широкие возможности открывает Портал для специалистов, ' +
        'заинтересованных участвовать в профильных им инженерных проектах. ' +
        'На Портале реализуются самые разнообразные проекты, в которых ' +
        'используется современное инженерное оборудования и широкий набор услуг.</p>' +
        
        '<p style="text-indent: 2em;">' +
        'Любой сертифицированный специалист, благодаря коммуникационным ' +
        'возможностям Личного кабинета, предоставленного ему на Портале, ' +
        'получает доступ к информации обо всех размещенных на Портале ' +
        'новых проектах. Выбрав один или несколько проектов, специалист может ' +
        'инициировать свое участие в них, и после проведения заказчиками ' +
        'конкурсных процедур, он может стать членом соответствующих ' +
        'исполнительских коллективов.</p>' +
        
        '<p style="text-indent: 2em;">' +
        'Кроме того, в целях повышения возможности быть включенным в новый проект ' +
        'в качестве профильного исполнителя, специалист может собрать вокруг себя ' +
        'на Портале Рабочую группу из различных специалистов, предназначенную ' +
        'для комплексного выполнения проектов. Также специалист может войти ' +
        'в состав уже существующих Рабочих групп, если в данных группах есть ' +
        'соответствующие вакансии.</p>' +
        
        '<p style="text-indent: 2em;">' +
        'Значительная часть исполнительской работы специалиста на Портале, ' +
        'связанная с согласованиями между членами рабочих групп, с подбором ' +
        'информации об оборудовании, с созданием проектной документации, ' +
        'договоров, актов и других документов, с проведением платежей, ' +
        'осуществляется специалистом через Личный кабинет, при использовании ' +
        'баз данных, навигации, коммуникативных возможностей Портала, а также ' +
        'его методической и технической базы.</p>' +
        
        '<p style="text-indent: 2em;">' +
        'Специалисты, успешно выполняющие свои функции в рамках проектов, ' +
        'а также эффективно работающие Рабочие группы, получают соответствующие ' +
        'рейтинги в размещенных на Портале справочниках пользователей-специалистов ' +
        'и имеют приоритет при подборе заказчиками исполнительских коллективов.</p>' +
        
        '<p style="text-indent: 2em;">' +
        'Кроме широких функциональных возможностей Портала, которые используют ' +
        'специалисты в своей работе, Портал предоставляет им также большой набор ' +
        'сервисов отдыха, в том числе телевещания, игр, музыки, ' +
        'благодаря чему работа пользователей-специалистов осуществляется ' +
        'в максимально комфортных условиях.</p>'
        
        + '</div>'
});